// // Напишите программу, которая на вход
// // принимает два целых числа и проверяет,
// // является ли первое число квадратом второго.
// // a = 25, b = 5 => да
// // a = 2, b = 10 => нет
// // a = 9, b = -3 => да
// // a = -3, b = 9 => нет

// // тип_данных имяПеременной = значение;
// // int firstNumber = 25;
// // int secondNumber = 5;
// // // "==" - проверкв на равенство: 5 == 5(true), 4 == 5 (false)
// // // secondNumbern * secondnumber == firstNumber
// // if(secondNumber * secondNumber == firstNumber)
// // {
// // Console.WriteLine("ДА");
// // }
// // else 
// // {
// //     Console.WriteLine("НЕТ");
// // }

// // Напишите программу, которая на вход принимает
// // целое число N, а на выходе показывает все целые
// // числа в промежутке от -N до N.
// // Примеры
// // 4 => -4, -3, -2, -1, 0, 1, 2, 3, 4
// // 2 => -2, -1, 0, 1, 2

// int N = 4;
// int negativeN = -N; // negativeN = -4
// while (negativeN <= N)
// {
//     Console.Write(negativeN + " "); 
//     // Конкатенация: "Привет" + "Мир" = "ПриветМир"
//     negativeN++; // инкремент, negativeN = negativeN + 1
// }

// Напишите программу, которая принимает на вход
// трёхзначное целое число и на выходе показывает сумму
// первой и последней цифры этого числа.
// 456 => 10
// 782 => 9
// 918 => 17

// int N = 6;
//  int negativeN = 1; // negativeN = 1
//  while (negativeN <= N)
//  {
//     if (negativeN % 2 == 0)
//      {
//         Console.Write(negativeN + " "); 
//      }
//      // Конкатенация: "Привет" + "Мир" = "ПриветМир"
//      negativeN++;
//    }  

